In [18]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [19]:
data = pd.read_excel("test2.xlsx")

In [20]:
data.head(20)

    num letters
0     1       a
1     2       b
2     3       c
3     4       a
4     5       b
5     6       c
6     7       a
7     8       b
8     9       c
9    10       a
10   11       b
11   12       d
12   13       e
13   14       e
14   15       e
15   16      ee
16   17     NaN
17   18       f
18   19       f
19   20       f

In [21]:
data.describe()

            num
count  20.00000
mean   10.50000
std     5.91608
min     1.00000
25%     5.75000
50%    10.50000
75%    15.25000
max    20.00000

In [22]:
data['letters']

0       a
1       b
2       c
3       a
4       b
5       c
6       a
7       b
8       c
9       a
10      b
11      d
12      e
13      e
14      e
15     ee
16    NaN
17      f
18      f
19      f
Name: letters, dtype: object

In [23]:
data.dtypes

num         int64
letters    object
dtype: object

In [24]:
data.loc[2:5]
new_data=data.loc[data['letters']=='a']

In [25]:
data.isnull().sum()

num        0
letters    1
dtype: int64

In [26]:
data.dropna(axis=0, inplace=True)

In [27]:
thesis_grades={'grades':['Adri','Ulisses','Pedro'],'Grade_1':[10,9,9]}

In [28]:
gradesDF=pd.DataFrame(thesis_grades)
gradesDF

    grades  Grade_1
0     Adri       10
1  Ulisses        9
2    Pedro        9

In [29]:
filter=gradesDF.loc[gradesDF['Grade_1']>9]

In [31]:
athletes=pd.read_csv("Forbes_atletas.csv")

In [32]:
athletes.head()

,S.NO,Name,Nationality,Current Rank,Previous Year Rank,Sport,Year,earnings ($ million)
0,1,Mike Tyson,USA,1,NaN,boxing,1990,28.6
1,2,Buster Douglas,USA,2,NaN,boxing,1990,26.0
2,3,Sugar Ray Leonard,USA,3,NaN,boxing,1990,13.0
3,4,Ayrton Senna,Brazil,4,NaN,auto racing,1990,10.0
4,5,Alain Prost,France,5,NaN,auto racing,1990,9.0

In [33]:
athletes['Nationality'].value_counts()

USA                 206
UK                   13
Germany              13
Switzerland          12
Portugal             10
Brazil                9
Argentina             9
Canada                6
Italy                 4
Finland               3
France                3
Philippines           3
Russia                1
Australia             1
Dominican             1
Austria               1
Filipino              1
Spain                 1
Serbia                1
Northern Ireland      1
Ireland               1
Mexico                1
Name: Nationality, dtype: int64

In [34]:
athletes.dtypes

S.NO                      int64
Name                     object
Nationality              object
Current Rank              int64
Previous Year Rank       object
Sport                    object
Year                      int64
earnings ($ million)    float64
dtype: object

In [35]:
missing_data=athletes.isnull().sum()

In [36]:
print(missing_data)

S.NO                     0
Name                     0
Nationality              0
Current Rank             0
Previous Year Rank      24
Sport                    0
Year                     0
earnings ($ million)     0
dtype: int64

In [37]:
y=athletes['earnings ($ million)']

In [38]:
x=athletes

In [39]:
x.drop('earnings ($ million)',axis=1,inplace=True)